	var index_cut = [
	// обход вершин по часовой стрелке
	// traversing vertices clockwise
		// Площадка 
		0, 1, 2, 3, 0,    // 0, 3, 2, 1, 0,  // грань 0

		// Корона
		0, 3, 7, 4, 0,    //0, 4, 7, 3, 0,  // грань 1
		1, 0, 4, 5, 1,    //1, 5, 4, 0, 1,  // грань 2
		2, 1, 5, 6, 2,    // 2, 6, 5, 1, 2,  // грань 3
		3, 2, 6, 7, 3,    //3, 7, 6, 2, 3,  // грань 4

		// Рундист
		4, 7, 11, 8, 4,   //4, 8, 11, 7, 4, // грань 5
		5, 4, 8, 9, 5,    //5, 9, 8, 4, 5,  // грань 6
		6, 5, 9, 10, 6,   //6, 10, 9, 5, 6, // грань 7
		7, 6, 10, 11, 7,  //7, 11, 10, 6, 7,// грань 8

		// Павильон
		12, 8, 11, 12,   // 12, 11, 8, 12,  // грань 9
		12, 9, 8, 12,    //12, 8, 9, 12,   // грань 10
		12, 10, 9, 12,   //12, 9, 10, 12,  // грань 11
		12, 11, 10, 12,  // 12, 10, 11, 12, // грань 12
		
		// Признак того, что граней больше нет
		-100      
	];
